import Nav from "../Navbar/Nav";


import "./Haj.css";

function Haj() {
  return (
    <>
      <Nav pageName="Haj" />

      <div className="container">
        <section id="hero_section">
          <div class="hero-video">
            <video controls autoplay muted loop id="bg-video">
              {" "}
              <source src="./hajj.mp4" type="video/mp4" />{" "}
            </video>

            {/* <iframe
              width="560"
              height="315"
              src="https://www.youtube.com/embed/avQA7hq1Tj0?autoplay=1&loop=1&mute=1&playlist=avQA7hq1Tj0"
              frameBorder="0"
              allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture"
              allowFullScreen
              title="Video Player"
            ></iframe> */}
          </div>

          <div class="overlay"></div>
          <div class="content">
            <h1>
              WHAT IS HAJJ
              <br /> IN ISLAM
            </h1>
            <br />
            <p>
              Here you will learn many things about Hajj, such as Hajj in Islam,
              Al-Raqeez al-khamsah in Islam, Hajj rites, Ihram, Al-Tawaf,
              Al_Sa'i, Waqf Arafat, Rami al-Jamarat, and etc...
            </p>
            <button className="btn btn-primary">
              Learn <i class="fa-solid fa-arrow-right"></i>
            </button>
          </div>
        </section>{" "}
        <br />
        <div className="container text-end">
          <h1>ما هو الحج في الإسلام؟</h1>
          <p>
            .الحج هو أحد الركائز الخمسة في الإسلام، وهو فرض على كل مسلم بالغ
            قادر مادياً وصحياً مرة واحدة في العمر، إذا استطاع السفر إلى مكة
            المكرمة. يتم الحج في الأيام العشرة الأولى من شهر ذي الحجة، وهو الشهر
            الثاني في التقويم الهجري
          </p>
          <h3>:تتضمن شعائر الحج عدة أعمال، منها</h3>
          <h4>:الإحرام</h4>
          <p>
            .تبتدأ رحلة الحاج بالإحرام، وهو النية المخلصة لأداء الحج مصحوبة
            بالطهارة واللباس الإحرام
          </p>
          <h4>:الطواف</h4>
          <p>
            .يبدأ الحاج طواف الكعبة المشرفة، حيث يدور حولها سبعة أشواط في اتجاه
            عكس اتجاه عقارب الساعة
          </p>
          <h4>:السعي</h4>
          <p>
            .بعد الطواف، يقوم الحاج بالسعي بين الصفا والمروة، حيث يتبع آثار هاجر
            وابنها إسماعيل عليهما السلام
          </p>
          <h4>:وقوف عرفة</h4>
          <p>
            .يوم الوقوف بعرفات يعتبر أهم أيام الحج، حيث يجتمع الحجاج في عرفات
            ويقضون اليوم في الدعاء والتضرع إلى الله
          </p>
          <h4>:رمي الجمرات</h4>
          <p>
            .يرمي الحاج الجمرة الكبرى والوسطى والصغرى بالحصى أو الأحجار الصغيرة،
            ممثلًا لرفض الشيطان وما يدعو إليه
          </p>
          <h4>:الذبح</h4>
          <p>.يقوم الحاج بذبح الهدي، تعبيرًا عن التضحية والتقرب إلى الله</p>
          <h4>:الحلاقة أو القص</h4>
          <p>.يقص الحاج شعر رأسه أو جزء منه، كجزء من شعائر الحج</p>
          <h4>:الطواف بالوداع</h4>
          <p>.يكون الطواف بالكعبة المشرفة للمرة الأخيرة قبل مغادرة مكة</p>
          <img class="card-img" src="./About-hajj1.jpg" alt="" />
          <br />
          <br />
          {/* <!-- second part --> */}
          <h3>
            الحج ليس فقط رحلة بدنية، بل هو أيضًا تجربة روحانية تهدف إلى تجديد
            الإيمان وتعزيز الوحدة الإسلامية والتضامن الإنساني
          </h3>{" "}
          <br />
          <h4>:التكبير والتهليل</h4>
          <p>
            .خلال أيام الحج والأعياد، يتكرر التكبير والتهليل والتكبير بين
            الحجاج، مما يمثل تقديرهم وتسبيحهم لله
          </p>
          <h4>:الإعتكاف</h4>
          <p>
            .يمكن للحجاج أداء الاعتكاف، وهو الابتعاد في مكان مقدس لقضاء وقت في
            العبادة والتضرع
          </p>
          <h4>:الصلوات</h4>
          <p>
            .يؤدّي الحجاج الصلوات في أوقاتها المحددة خلال أيام الحج، مع التركيز
            على الخشوع والتأمل
          </p>
          <h4>:الزيارة للأماكن المقدسة</h4>
          <p>
            .بالإضافة إلى الكعبة والمسجد النبوي، يقوم الحاج بزيارة الأماكن
            المقدسة الأخرى في مكة والمدينة المنورة، مثل جبل عرفات وغار حراء
          </p>
          <h4>:العناية بالمعتمرين</h4>
          <p>
            .يُعتبر الحج مناسبة للتضامن ومساعدة المعتمرين والحجاج الآخرين،
            وتشجيع الخير والتسامح
          </p>
          <h4>:الاحتفال بعيد الأضحى</h4>
          <p>
            .بعد الحج، يحتفل المسلمون بعيد الأضحى المبارك، حيث يذبح الحجاج الهدي
            ويقدم الأضاحي ويشاركون الفرحة مع العائلة والأصدقاء
          </p>
          <h4>:تعليم الأمر بالمعروف والنهي عن المنكر</h4>
          <p>
            .يعتبر الحج فرصة لتعزيز القيم الإسلامية وتوجيه الناس للخير وتحذيرهم
            من الشر، وذلك من خلال تعليم الأمر بالمعروف والنهي عن المنكر وتذكيرهم
            بأهمية الأخلاق والتقوى
          </p>
          <h3>
            هذه بعض النقاط المهمة حول الحج في الإسلام، وهناك الكثير من التفاصيل
            والعبادات المتعلقة بهذا الشعيرة العظيمة
          </h3>
          <img class="card-img" src="./About-hajj2.jpg" alt="" />
          <br />
          <br />
          {/* <!-- third part --> */}
          <br />
          <h3>دعونا نتعلم شيئا أكثر عن الحج</h3>
          <h4>:التواصل الاجتماعي</h4>
          <p>
            .خلال الحج، يتم تواصل المسلمين من مختلف أنحاء العالم، مما يعزز
            الوحدة الإسلامية ويساهم في تبادل الخبرات والثقافات
          </p>
          <h4>:الاعتناء بالصحة</h4>
          <p>
            .يُشجّع الحجاج على الاعتناء بصحتهم واتباع الإرشادات الصحية، خاصة في
            ظل التحديات الصحية المعاصرة مثل جائحة كوفيد-19
          </p>
          <h4>:السلام والتسامح</h4>
          <p>
            .يشكل الحج مناسبة لتعزيز قيم السلام والتسامح والتعايش السلمي بين
            الناس من مختلف الثقافات والجنسيات
          </p>
          <h4>:العلم والتعليم</h4>
          <p>
            .يتيح الحج فرصة للحجاج لاكتساب المعرفة والتعلم، سواء من خلال الدروس
            الدينية والمحاضرات أو من خلال التفاعل مع العلماء والدعاة المتواجدين
            في مكة والمدينة.
          </p>
          <h4>:الإحسان والتعاون</h4>
          <p>
            .يعزز الحج قيم الإحسان والتعاون، حيث يتعاون الحجاج في تقديم الخدمات
            لبعضهم البعض وللمعتمرين، ويتبرعون بالصدقات والأعمال الخيرية
          </p>
          <h4>:تعزيز الروحانية</h4>
          <p>
            .يمثل الحج فرصة للحجاج لتعزيز روحانيتهم وتقوية علاقتهم بالله من خلال
            العبادة والدعاء والتفكر في آيات الله في الطبيعة والمكان المقدس
          </p>
          <h4>:تعزيز الشعور بالانتماء</h4>
          <p>
            .يساهم الحج في تعزيز الشعور بالانتماء للأمة الإسلامية والاندماج في
            مجتمع الحجاج العالمي
          </p>
          <h4>:التأمل والتفكر</h4>
          <p>
            .يتيح الحج للحجاج فرصة للتأمل والتفكر في معاني الحياة وأهمية الدور
            الشخصي في خدمة الإسلام والبشرية
          </p>
          <h4>:الشكر والامتنان</h4>
          <p>
            .يعتبر الحج فرصة للحجاج للشكر والامتنان لنعم الله عليهم ولتجربة الحج
            نفسها ولفرصة الغفران والتجديد
          </p>
          <h4>:التوبة والغفران</h4>
          <p>
            .يُعتبر الحج فرصة للتوبة والغفران، حيث يدعو الحاج إلى التوبة من
            الذنوب والاستغفار وطلب المغفرة من الله
          </p>
          <br />
          <br />
        </div>
        <br />
      </div>
    </>
  );
}

export default Haj;
